Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: When an XML file is created and the ``<widget>`` root element is used, the following .C/.H files are generated automatically:
it_it: Quando viene creato un file XML e viene utilizzato l'elemento radice ``<widget>``, vengono generati automaticamente i seguenti file .C/.H:

source: When an XML file is registered, the contents of the ``<animations>`` section are parsed, and the ``<timeline>``'s data is stored as a "blueprint".
it_it: Quando un file XML viene registrato, il contenuto della sezione ``<animations>`` viene analizzato e i dati della ``<timeline>`` vengono memorizzati come "blueprint" [progetto].

source: When an ``lv_display_t`` object is created, 4 permanent :ref:`screens` that facilitate layering are created and attached to it.
it_it: Quando viene creato un oggetto ``lv_display_t``, vengono creati e associati a esso 4 :ref:`screens` permanenti che facilitano il "layering" [sovrapposizione].

source: When an ``lv_display_t`` object is created, with it are created 4 Screens set up to help you manage layering of displayed Widgets.
it_it: Quando viene creato un oggetto ``lv_display_t``, vengono creati 4 schermi impostati per aiutare a gestire la sovrapposizione dei Widget visualizzati.

source: When an ``lv_draw_...`` function is called, it creates a Draw Task, copies the draw descriptor into a ``malloc``\ ed memory block, and frees it automatically when needed.
it_it: Quando viene chiamata una funzione ``lv_draw_...``, questa crea un Task di Disegno, copia il descrittore di disegno in un blocco di memoria da ``malloc``, e lo libera automaticamente quando necessario.

source: When an environment is created, the source image is processed into a cube map format (6 images representing each face of a cube).
it_it: Quando viene creato un ambiente, l'immagine sorgente viene elaborata in un formato cube map (6 immagini che rappresentano ciascuna faccia di un cubo).

source: When an error occurs, the target that failed and those that depend on it cannot be remade.
it_it: Quando si verifica un errore, il target che ha generato l'errore e quelli che dipendono da esso non possono essere ripristinati.

source: When an error parameter is detected, an assertion will occur to print out the error parameter, allowing the user to promptly make corrections and reduce the time wasted on hardware simulation.
it_it: Quando viene rilevato un parametro di errore, verrà eseguita un'asserzione per visualizzarlo, consentendo all'utente di apportare tempestivamente correzioni e ridurre il tempo sprecato nella simulazione hardware.

source: When an image needs to be drawn, the library will try all the registered image decoders until it finds one which can open the image, i.e. one which knows that format.
it_it: Quando è necessario disegnare un'immagine, la libreria proverà tutti i decodificatori di immagini registrati finché non ne trova uno in grado di aprirla, ovvero uno che riconosce quel formato.

source: When an instance of a Component or Screen is created, as the last step ``lv_anim_timeline``\ s are created and initialized from the saved "blueprints".
it_it: Quando viene creata un'istanza di un Componente o di uno Screen, come ultimo passaggio vengono creati e inizializzati ``lv_anim_timeline`` dai "blueprint" salvati.

source: When any of these 3 input values change, the label needs to be updated, and it needs to know all 3 values to compose its text.
it_it: Quando uno qualsiasi di questi 3 valori di input cambia, l'etichetta deve essere aggiornata e deve conoscere tutti e 3 i valori per comporre il suo testo.

source: When building for 32-bit architecture, add the following workaround at the beginning of ``main``:
it_it: Quando si compila per un'architettura a 32 bit, aggiungere la seguente soluzione alternativa all'inizio di ``main``:

source: When building lv_micropython, the public LVGL C API is scanned and MicroPython API is auto-generated.
it_it: Durante la compilazione di lv_micropython, l'API C pubblica di LVGL viene analizzata e l'API MicroPython viene generata automaticamente.

source: When changing the rotation, the :cpp:enumerator:`LV_EVENT_SIZE_CHANGED` event is emitted to allow for hardware reconfiguration.
it_it: Quando si modifica la rotazione, viene generato l'evento :cpp:enumerator:`LV_EVENT_SIZE_CHANGED` per consentire la riconfigurazione hardware.

source: When code is exported from the UI Editor, the permanent screens are actually created and stored in global pointers.
it_it: Quando il codice viene esportato dall'Editor dell'Interfaccia Utente, le schermate permanenti vengono effettivamente create e memorizzate in puntatori globali.

source: When commenting code, use block comments like this ``/* Description */``, not end-of-line comments like this ``// Description``.
it_it: Quando si commenta il codice, usare commenti a blocchi come questo ``/* Description */``, non commenti di fine riga come questo ``// Description``.

source: When compared to pure software rotation, using the PPA to rotate the objects can save up 40% of rendering time in average, while keeping the CPU in idle saving power, or using it to perform other tasks, PPA rotation is asynchronous, and once started it will signal the application using its dedicated interrupt.
it_it: Rispetto alla rotazione software pura, l'utilizzo del PPA per ruotare gli oggetti può far risparmiare in media fino al 40% del tempo di rendering, mantenendo la CPU inattiva per risparmiare energia o utilizzandola per eseguire altre attività. La rotazione del PPA è asincrona e, una volta avviata, segnalerà l'applicazione tramite l'interrupt dedicato.

source: When creating a new interface in the LVGL Editor, a ``CMakeLists.txt`` file is generated, which allows for conditional fields, differentiating between what belongs to the editor and the target project.
it_it: Quando si crea una nuova interfaccia nell'editor LVGL, viene generato un file ``CMakeLists.txt``, che consente l'uso di campi condizionali, distinguendo tra ciò che appartiene all'editor e ciò che appartiene al progetto target.

source: When creating this display, the horizontal and vertical resolutions must be passed.
it_it: Quando si crea questo display, è necessario passare le risoluzioni orizzontale e verticale.

source: When documenting a code member that is *before* the comment, such as a struct member, use ``/**<`` like this:
it_it: Quando si documenta un pezzo di codice che si trova *prima* del commento, come un membro di una struttura, usare ``/**<`` in questo modo:

source: When each :ref:`Draw Task <draw tasks>` is created, each existing Draw Unit is "consulted" as to its "appropriateness" for the task.
it_it: Quando viene creata ciascuna :ref:`Draw Task <draw tasks>`, ogni Draw Unit viene "consultata" in merito alla sua "appropriatezza" per il task.

source: When each :ref:`display` object was created, a default screen was created with it and set as its "Active Screen".
it_it: Quando ogni oggetto :ref:`display` è stato creato, è stato creato uno Screen di default con esso e impostato come "Screen Attivo".

source: When enabled :cpp:func:`lv_littlefs_set_handler` can be used to set up a mount point.
it_it: Se abilitato, :cpp:func:`lv_littlefs_set_handler` può essere utilizzato per impostare un "mount point" [punto di montaggio].

source: When enabled builds the demos
it_it: Se abilitato, compila le demo

source: When enabled builds the examples
it_it: Se abilitato, compila gli esempi

source: When enabled in ``lv_conf.h`` by setting :c:macro:`LV_USE_TINY_TTF` to ``1``, :cpp:expr:`lv_tiny_ttf_create_data(data, data_size, font_size)` can be used to create a TTF font instance with the specified line height.
it_it: Se abilitata in ``lv_conf.h`` impostando :c:macro:`LV_USE_TINY_TTF` a ``1``, :cpp:expr:`lv_tiny_ttf_create_data(data, data_size, font_size)` può essere utilizzata per creare un'istanza di font TTF con l'altezza di riga specificata.

source: When enabled the in-tree LVGL version of ThorVG is compiled
it_it: Se abilitato, viene compilata la versione LVGL in-tree di ThorVG

source: When enabled the private headers ``*_private.h`` are installed on the system
it_it: Se abilitato, vengono installati sul sistema gli header privati ``*_private.h``

source: When enabled the resources will include ``lvgl.h`` as a simple include, this option is enabled by default.
it_it: Se abilitata, le risorse includeranno ``lvgl.h`` come semplice "include"; questa opzione è abilitata di default.

source: When enabled, there is also a "Quick-Access" panel on the left, which provides a convenient way to reach parts of the file system that are frequently accessed.
it_it: Se abilitato, sulla sinistra è presente anche un pannello di "Accesso rapido", che offre un modo comodo per raggiungere le parti del file system a cui si accede di frequente.

source: When enabled, this option runs a script that processes the ``lv_conf.h``/Kconfig configuration using ``pcpp`` to generate corresponding ``CONFIG_LV_*`` and ``CONFIG_LV_BUILD_*`` CMake variables based on the contents of ``lv_conf_internal.h``.
it_it: Se abilitata, questa opzione esegue uno script che elabora la configurazione ``lv_conf.h``/Kconfig utilizzando ``pcpp`` per generare le variabili CMake ``CONFIG_LV_*`` e ``CONFIG_LV_BUILD_*`` corrispondenti in base al contenuto di ``lv_conf_internal.h``.

source: When hitting the generate button, CMake will create solution files (for VS) or Ninja Files (for Linux Ninja Build)
it_it: Premendo il pulsante *generate*, CMake creerà file di soluzione (per VS) o file Ninja (per la build Ninja per Linux).

source: When it equates to a non-zero value the following function implementations are provided by LVGL:
it_it: Quando equivale a un valore diverso da zero, LVGL fornisce le seguenti implementazioni di funzione:

source: When it is about to be filled, it will forcibly wait for the unfinished drawing tasks to end and swap the command buffer.
it_it: Quando sta per essere riempito, attenderà forzatamente la fine delle attività di disegno non completate e scambierà il buffer dei comandi.

source: When it's open, it's a graphical editor tab called "Manage Solution" with a gear icon.
it_it: Una volta aperto, si presenta come una scheda dell'editor grafico chiamata "Manage Solution" con un'icona a forma di ingranaggio.

source: When loaded from a file, the file name is used as the Component name.
it_it: Quando caricato da un file, il nome del file viene utilizzato come nome del Componente.

source: When more detail is needed, add a blank line below the brief description and add additional information that may be needed by LVGL API users, including preconditions for calling the function.
it_it: Quando sono necessari maggiori dettagli, aggiungere una riga vuota sotto la breve descrizione e aggiungere ulteriori informazioni che potrebbero essere necessarie agli utenti dell'API LVGL, incluse le precondizioni per la chiamata della funzione.

source: When more than one child Widget have non-zero grow values, all available space will be distributed in proportion to their respective grow values.
it_it: Quando più di un widget figlio ha valori di grow diversi da zero, tutto lo spazio disponibile verrà distribuito in proporzione ai rispettivi valori di grow.

source: When multiple CPU cores are available and a large area needs to be redrawn, LVGL must identify independent areas that can be rendered in parallel.
it_it: Quando sono disponibili più core della CPU e un'area estesa deve essere ridisegnata, LVGL deve identificare aree indipendenti che possano essere renderizzate in parallelo.

source: When multiple strings are used in a property or string array, ``'`` should be used.
it_it: Quando si utilizzano più stringhe in una proprietà o in un array di stringhe, si dovrebbe usare ``'`` [apice].

source: When one buffer has completed rendering and another is actively undergoing DMA transfer, the third buffer enables immediate rendering of the next frame, eliminating CPU/GPU idle time caused by waiting for DMA completion.
it_it: Quando un buffer ha completato il rendering e un altro è in fase di trasferimento DMA, il terzo buffer abilita il rendering immediato del frame successivo, eliminando i tempi di inattività di CPU/GPU causati dall'attesa del completamento del DMA.

source: When picking/designing a lottie animation consider the following limitations:
it_it: Quando si sceglie/progetta un'animazione lottie, si considerino le seguenti limitazioni:

source: When registering ``globals.xml`` with :cpp:expr:`lv_xml_register_component_from_file("A:path/to/globals.xml")`, fonts are automatically created with the selected font engine and mapped to the given names.
it_it: Quando si registra ``globals.xml`` con :cpp:expr:`lv_xml_register_component_from_file("A:path/to/globals.xml")`, i font vengono creati automaticamente con il motore del font selezionato e mappati ai nomi specificati.

source: When registering ``globals.xml`` with :cpp:expr:`lv_xml_register_component_from_file("A:path/to/globals.xml")`, names are automatically mapped to the path.
it_it: Quando si registra ``globals.xml`` con :cpp:expr:`lv_xml_register_component_from_file("A:path/to/globals.xml")`, i nomi vengono automaticamente mappati al path.

source: When rendering a part of a Widget, helper functions can initialize draw descriptors based on the styles, and a specific Widget part in the current state.
it_it: Durante il rendering di una parte di un Widget, le funzioni di supporto possono inizializzare i descrittori di disegno in base agli stili e a una parte specifica del Widget nello stato corrente.

source: When rotating a source image and the output is not divisible by the block size, the incorrect pixels could be truncated and the final output image can look shifted.
it_it: Quando si ruota un'immagine sorgente e l'output non è divisibile per la dimensione del blocco, i pixel errati potrebbero essere troncati e l'immagine di output finale potrebbe apparire spostata.

source: When running the `lv_demo_benchmark` from LVGL the user can compare the performance when the PPA is enabled versus the pure software rendering, by using the latest version of the LVGL and LVGL port component it can be observed an average saving of 30% of the rendering time for draw tasks that are image and rectangle fill.
it_it: Eseguendo `lv_demo_benchmark` da LVGL, l'utente può confrontare le prestazioni con PPA abilitato rispetto al rendering software puro. Utilizzando l'ultima versione di LVGL e il porting del componente LVGL, si può osservare un risparmio medio del 30% del tempo di rendering per le attività di disegno come il riempimento di immagini e rettangoli.

source: When set KConfig is used as the configuration source.
it_it: Quando impostato, KConfig viene utilizzato come sorgente della configurazione.

source: When setting up the buffers for rendering (:cpp:func:`lv_display_set_buffers`), make the buffer 8 bytes larger.
it_it: Quando si impostano i buffer per il rendering (:cpp:func:`lv_display_set_buffers`), aumentare la dimensione del buffer di 8 byte.

source: When setting up your project for the first time, copy ``lvgl/lv_conf_template.h`` to ``lv_conf.h`` next to the ``lvgl`` folder.
it_it: Quando si imposta il progetto per la prima volta, si deve copiare ``lvgl/lv_conf_template.h`` in ``lv_conf.h`` accanto alla cartella ``lvgl``.

source: When something in your system relies on more than one value (i.e. it needs to be notified when any of a SET of two or more values changes), it can be made an Observer of a Subject Group.
it_it: Quando un elemento del sistema si basa su più di un valore (ad esempio, deve essere avvisato quando cambia uno qualsiasi di un SET di due o più valori), può essere impostato come Observer di un Gruppo di Subject.

source: When something needs to be drawn, a series of commands are sent to EVE.
it_it: Quando è necessario disegnare qualcosa, una serie di comandi viene inviata a EVE.

source: When tabs are on the top or bottom, this means the height of the tab bar, and when they are on the sides, it means the width.
it_it: Quando i tab sono in alto o in basso, questo si riferisce all'altezza della barra dei tab, mentre quando sono ai lati, si riferisce alla larghezza.

source: When the Arc's value is changed by pointer input (finger, mouse, etc.), the rate of its change is limited according to its *change rate*.
it_it: Quando il valore dell'Arco viene modificato tramite l'input del puntatore (dito, mouse, ecc.), la velocità di variazione è limitata in base al suo *change rate* [velocità di variazione].

source: When the Checkbox is clicked the tick box is toggled.
it_it: Quando si clicca sulla Checkbox, la casella di controllo viene attivata/disattivata.

source: When the Editor Pane is editing an XML file defining a Component or Widget, the Preview Pane shows a live preview of the XML UI definition being edited, pushed through *real LVGL rendering* so you can instantly see the results of your work, that will match the final result produced by firmware, accurate down to the pixel.
it_it: Quando il "Pannello Editor" modifica un file XML che definisce un Componente o un Widget, il "Pannello Preview" mostra un'anteprima in tempo reale della definizione dell'Interfaccia Utente XML in fase di modifica, sottoposta a *rendering LVGL reale*, in modo da poter visualizzare immediatamente i risultati del lavoro, che corrisponderanno al risultato finale prodotto dal firmware, con una precisione al pixel.

source: When the GPU is busy, it will continue to fill the command buffer cache with rendering instructions.
it_it: Quando la GPU è occupata, continuerà a riempire la cache del buffer di comando con le istruzioni di rendering.

source: When the GPU is idle, it will immediately call ``vg_lite_flush`` to notify the GPU to start rendering and swap the command buffer.
it_it: Quando la GPU è inattiva, chiamerà immediatamente ``vg_lite_flush`` per notificare alla GPU di avviare il rendering e scambiare il buffer di comando.

source: When the Linux kernel initializes, it sets up subsystems like the framebuffer (fbdev) to manage display output.
it_it: Quando il kernel Linux si inizializza, imposta sottosistemi come il framebuffer (fbdev) per gestire l'output del display.

source: When the Roller is scrolled and doesn't stop exactly on an item, it will automatically scroll to the nearest valid item in ``anim_time`` milliseconds as specified in the ``anim_duration`` style.
it_it: Quando il Roller scorre e non si ferma esattamente su un elemento, scorrerà automaticamente fino all'elemento valido più vicino in ``anim_time`` millisecondi, come specificato nello stile ``anim_duration``.

source: When the Timer system has been disabled (causing :cpp:func:`lv_timer_handler` to return early before it has processed any timers), if you want to take some action when the Timer system is re-enabled again, set a resume callback using :cpp:expr:`lv_timer_handler_set_resume_cb(cb, user_data)`.
it_it: Quando il sistema dei timer è stato disabilitato (causando il ritorno anticipato di :cpp:func:`lv_timer_handler` prima di aver elaborato i timer), per intraprendere un'azione quando il sistema dei timer viene riabilitato, impostare una callback di ripristino utilizzando :cpp:expr:`lv_timer_handler_set_resume_cb(cb, user_data)`.

source: When the Widget has focus and pressed both gray and red would work, but the pressed state has higher precedence than focused so gray color will be used.
it_it: Quando il Widget ha il focus ed è premuto, funzionerebbero sia il grigio che il rosso, ma lo stato pressed ha una precedenza maggiore rispetto allo stato focused, quindi verrà utilizzato il colore grigio.

source: When the Widget has focus the same thing happens as in pressed state and red color will be used.
it_it: Quando il widget è attivo, accade la stessa cosa di quando si trova nello stato "pressed" e verrà utilizzato il colore rosso.

source: When the Widget is in the checked state there is no property to set the background color for this state.
it_it: Quando il Widget è nello stato checked, non esiste alcuna proprietà per impostare il colore di background per questo stato.

source: When the Widget is pressed there are 2 related properties: default with white (default is related to every state) and pressed with gray.
it_it: Quando si preme il Widget, ci sono 2 proprietà correlate: il default con bianco (il default è relativo a tutti gli stati) e "pressed" con grigio.

source: When the Widget is released the content scrolled in it is animated back to the closest valid position.
it_it: Quando il Widget viene rilasciato, il contenuto che scorre al suo interno viene riportato alla posizione valida più vicina.

source: When the XML is loaded at runtime, the callback name needs to be mapped to a function using :cpp:expr:`lv_xml_register_event_cb("my_callback_1", an_event_handler)`.
it_it: Quando l'XML viene caricato in fase di esecuzione, il nome della callback deve essere mappato a una funzione utilizzando :cpp:expr:`lv_xml_register_event_cb("my_callback_1", an_event_handler)`.

source: When the buffer is full, the trace system prints the log information through the provided user interface.
it_it: Quando il buffer è pieno, il sistema di trace stampa le informazioni di log tramite l'interfaccia utente fornita.

source: When the buffer used to store trace events becomes full, the profiler will output all the data in the buffer, which can cause UI blocking and stuttering during the output.
it_it: Quando il buffer utilizzato per memorizzare gli eventi di trace si riempie, il profiler emetterà in output tutti i dati presenti nel buffer, il che può causare blocchi dell'interfaccia utente e interruzioni durante l'output.

source: When the button is pressed the light-gray color is a better match because it describes the current state perfectly, so the button will be light-gray.
it_it: Quando il pulsante viene premuto, il colore grigio chiaro è una corrispondenza migliore perché descrive perfettamente lo stato corrente, quindi il pulsante sarà grigio chiaro.

source: When the color format of the image is not in the same format as the :ref:`Display <display>` it will be sent to, the drawing logic converts those pixels to the target Display's format (into a buffer) when it is drawn.
it_it: Quando il formato colore dell'immagine non è lo stesso del :ref:`Display <display>` a cui verrà inviata, la logica di disegno converte quei pixel nel formato del Display di destinazione (in un buffer) quando viene disegnata.

source: When the cursor is added, it will be placed on the system layer (:cpp:expr:`lv_layer_sys()`) and positioned at the last coordinate read.
it_it: Quando il cursore viene aggiunto, verrà posizionato sul layer di sistema (:cpp:expr:`lv_layer_sys()`) e posizionato sull'ultima coordinata letta.

source: When the fetch task has been completed, you can find the fetched sources in ``build/downloads``.
it_it: Una volta completato il task di recupero (fetch), è possibile trovare i codici sorgente recuperati in ``build/downloads``.

source: When the first :ref:`display` object is created, it becomes the Default Display.
it_it: Quando viene creato il primo oggetto :ref:`display`, questo diventa il Display di Default.

source: When the package configuration is completed, build the environment to add the packages (``make`` in **output** folder).
it_it: Una volta completata la configurazione del pacchetto, si compila l'ambiente per aggiungere i pacchetti (``make`` nella cartella **output**).

source: When the script is executed, an (almost) empty folder named ``output`` is created, as the build process has not yet begun.
it_it: Quando lo script viene eseguito, viene creata una cartella (quasi) vuota denominata ``output``, poiché il processo di build non è ancora iniziato.
